MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EZR32LG230F256R61/mcu.h
// #include "core_cm3.h"     /* Cortex-M3 processor and core peripherals */  // Note: Changed for MikroE implementation.
// #include "system_ezr32lg.h" /* System Header */  // Note: Changed for MikroE implementation.
#include <stdint.h>
#define     __I     volatile const       /*!< Defines 'read only' permissions */
#define     __O     volatile             /*!< Defines 'write only' permissions */
#define     __IO    volatile             /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} PRS_CH_TypeDef;

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} DMA_CH_TypeDef;

typedef struct {
  __IOM uint32_t CFG;                                /**< Configuration                                      */
  __IOM uint32_t LOOP;                               /**< Loop Counter                                       */
  __IOM uint32_t CTRL;                               /**< Control                                            */
  __IOM uint32_t SRC;                                /**< Source Address                                     */
  __IOM uint32_t DST;                                /**< Destination Address                                */
  __IOM uint32_t LINK;                               /**< Link Address                                       */
  __IOM uint32_t XCTRL;                              /**< Extended Control                                   */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t ILSRC;                              /**< Interleaving Source Address                        */
  uint32_t       RESERVED1[3U];                      /**< Reserved for future use                            */
} LDMA_CH_TypeDef;

/** @} End of group EZR32LG230F256R61_Part */

/***************************************************************************//**
 * @defgroup EZR32LG230F256R61_Peripheral_TypeDefs EZR32LG230F256R61 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 ******************************************************************************/

// #include "ezr32lg_dma_ch.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_dma.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_aes.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_msc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_emu.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_rmu.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EZR32LG230F256R61_CMU EZR32LG230F256R61 CMU
 * @{
 * @brief EZR32LG230F256R61_CMU Register Declaration
 ******************************************************************************/
typedef struct {
  __IOM uint32_t CTRL;          /**< CMU Control Register  */
  __IOM uint32_t HFCORECLKDIV;  /**< High Frequency Core Clock Division Register  */
  __IOM uint32_t HFPERCLKDIV;   /**< High Frequency Peripheral Clock Division Register  */
  __IOM uint32_t HFRCOCTRL;     /**< HFRCO Control Register  */
  __IOM uint32_t LFRCOCTRL;     /**< LFRCO Control Register  */
  __IOM uint32_t AUXHFRCOCTRL;  /**< AUXHFRCO Control Register  */
  __IOM uint32_t CALCTRL;       /**< Calibration Control Register  */
  __IOM uint32_t CALCNT;        /**< Calibration Counter Register  */
  __IOM uint32_t OSCENCMD;      /**< Oscillator Enable/Disable Command Register  */
  __IOM uint32_t CMD;           /**< Command Register  */
  __IOM uint32_t LFCLKSEL;      /**< Low Frequency Clock Select Register  */
  __IM uint32_t  STATUS;        /**< Status Register  */
  __IM uint32_t  IF;            /**< Interrupt Flag Register  */
  __IOM uint32_t IFS;           /**< Interrupt Flag Set Register  */
  __IOM uint32_t IFC;           /**< Interrupt Flag Clear Register  */
  __IOM uint32_t IEN;           /**< Interrupt Enable Register  */
  __IOM uint32_t HFCORECLKEN0;  /**< High Frequency Core Clock Enable Register 0  */
  __IOM uint32_t HFPERCLKEN0;   /**< High Frequency Peripheral Clock Enable Register 0  */
  uint32_t       RESERVED0[2U]; /**< Reserved for future use **/
  __IM uint32_t  SYNCBUSY;      /**< Synchronization Busy Register  */
  __IOM uint32_t FREEZE;        /**< Freeze Register  */
  __IOM uint32_t LFACLKEN0;     /**< Low Frequency A Clock Enable Register 0  (Async Reg)  */
  uint32_t       RESERVED1[1U]; /**< Reserved for future use **/
  __IOM uint32_t LFBCLKEN0;     /**< Low Frequency B Clock Enable Register 0 (Async Reg)  */

  uint32_t       RESERVED2[1U]; /**< Reserved for future use **/
  __IOM uint32_t LFAPRESC0;     /**< Low Frequency A Prescaler Register 0 (Async Reg)  */
  uint32_t       RESERVED3[1U]; /**< Reserved for future use **/
  __IOM uint32_t LFBPRESC0;     /**< Low Frequency B Prescaler Register 0  (Async Reg)  */
  uint32_t       RESERVED4[1U]; /**< Reserved for future use **/
  __IOM uint32_t PCNTCTRL;      /**< PCNT Control Register  */

  uint32_t       RESERVED5[1U]; /**< Reserved for future use **/
  __IOM uint32_t ROUTE;         /**< I/O Routing Register  */
  __IOM uint32_t LOCK;          /**< Configuration Lock Register  */
} CMU_TypeDef;                  /**< CMU Register Declaration *//** @} */

// #include "ezr32lg_lesense_st.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_lesense_buf.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_lesense_ch.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_lesense.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_usart.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_timer_cc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_timer.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_acmp.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_leuart.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_rtc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_letimer.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_i2c.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_gpio_p.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_gpio.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_vcmp.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_prs_ch.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EZR32LG230F256R61_PRS EZR32LG230F256R61 PRS
 * @{
 * @brief EZR32LG230F256R61_PRS Register Declaration
 ******************************************************************************/
typedef struct {
  __IOM uint32_t SWPULSE;       /**< Software Pulse Register  */
  __IOM uint32_t SWLEVEL;       /**< Software Level Register  */
  __IOM uint32_t ROUTE;         /**< I/O Routing Register  */

  uint32_t       RESERVED0[1U]; /**< Reserved registers */
  PRS_CH_TypeDef CH[12U];       /**< Channel registers */
} PRS_TypeDef;                  /**< PRS Register Declaration *//** @} */

// #include "ezr32lg_adc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_dac.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_burtc_ret.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_burtc.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_wdog.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_etm.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_devinfo.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_romtable.h"  // Note: Changed for MikroE implementation.
// #include "ezr32lg_calibrate.h"  // Note: Changed for MikroE implementation.

